# Elbow Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPCurveType..::..Elbow Property
MEPCurveType Class See Also
---
The default elbow fitting of the MEP curve type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public FamilySymbol Elbow { get; set; }
```

Visual Basic
---
```text
Public Property Elbow As FamilySymbol
	Get
	Set
```

Visual C++
---
```text
public:
property FamilySymbol^ Elbow {
	FamilySymbol^ get ();
	void set (FamilySymbol^ value);
}
```

# Remarks
This property is used to retrieve the default elbow fitting of the MEP curve type, and can be nullNothingnullptra null reference (Nothing in Visual Basic) if there is no default value. Use RoutingPreferenceManager to set this property for PipeType MEPCurves.
# See Also
MEPCurveType Class
Autodesk.Revit.DB Namespace